# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

a = input('введите трехзначное число  : ' )
a = int(a)
b = a // 100
c = (a // 10) % 10
d = a % 10
result = b + c + d
print(f"{a} -> {result} ({b} + {c} + {d})")